imported/solids4foam/tutorials/fluidSolidInteraction/wavesOnDam/constant/fluid/waveProperties.input
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      environmentalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel	0.08;

seaLevelAsReference 1;

// A list of the relaxation zones in the simulation. The parameters are given
// in <name>Coeffs below.
relaxationNames (inlet); // outlet);

initializationName inlet; //outlet;

inletCoeffs
{
    // Wave type to be used at boundary "inlet" and in relaxation zone "inlet"
    waveType    stokesFirst;  
    
    // Ramp time of 2 s
    Tsoft       0.2; //2;

    // Water depth at the boundary and in the relaxation zone
    depth       0.08; //0.400000;

    // Wave period
    period      0.2; //2.0;

    // Phase shift in the wave
    phi         0.000000;

    // Wave number vector, k. 
    direction  (1.0 0.0 0.0);

    // Wave height
    height      0.02;
    
    // Specifications on the relaxation zone shape and relaxation scheme
    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;
    
        relaxType   INLET;
        startX      (0 0.0 -1);
        //endX        (5 0.0  1);
        endX        (0.05 0.0  1);
        orientation      (1.0 0.0 0.0);
    }
};

// outletCoeffs
// {
//     waveType    potentialCurrent;
//     U           (0 0 0);
//     Tsoft       0;

//     relaxationZone
//     {
//         relaxationScheme Spatial;
//         relaxationShape  Rectangular;
//         beachType        Empty;    

//         relaxType   OUTLET;
//         // startX      (13 0.0 -1);
//         // endX        (18 0.0  1);
//         startX      (0.58 0.0 -1);
//         endX        (0.584 0.0  1);
//         orientation      (1.0 0.0 0.0);
//     }
// };



// ************************************************************************* //
