imported/solids4foam/tutorials/fluidSolidInteraction/wavesOnDam/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface    Aitken;

AitkenCoeffs
{
    // Solid interface patch list
    solidPatch interface;

    // Fluid interface patch list
    fluidPatch interface;

    // Fixed under-relaxation factor for first FSI iteration
    relaxationFactor 0.4;

    // Limit for enabling fluid mesh motion solver
    interfaceDeformationLimit 0;

    // FSI loop tolerance
    outerCorrTolerance 1e-6;

    // FSI max correctors
    nOuterCorr 20;

    interpolatorUpdateFrequency 0;
    // couplingReuse 0;

    // Enable FSI coupling
    coupled yes;
}

// ************************************************************************* //
