imported/solids4foam/tutorials/fluidSolidInteraction/wavesOnDam/constant/solid/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress no;

mechanical
(
    flexibleMaterial
    {
        type        linearElastic;
        //type        neoHookeanElastic;
        rho         rho [1 -3 0 0 0 0 0] 8000;
        E           E [1 -1 -2 0 0 0 0] 0.2e6;
        nu          nu [0 0 0 0 0 0 0] 0.3;
    }
);

// ************************************************************************* //
